<?php

use core\models\customer\Customer;
use yii\db\Migration;

/**
 * Class m180404_084138_fix_customer_name
 */
class m180404_084138_fix_customer_name extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        foreach ($this->customers as $customer_id => $data) {
            $model = Customer::findOne($customer_id);

            if (!$model) {
                continue;
            }

            $data = json_decode($data);

            if (strpos($data->new->name, $data->old->name) !== false) {
                if (strpos($data->new->name, $model->lastname) !== false) {
                    $model->name = trim($data->old->name);
                    $model->update(false);
                }
            }
        }
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        echo "m180404_084138_fix_customer_name cannot be reverted.\n";
    }

    private $customers
        = [
            301473 => '{"old":{"name":"Замир"},"new":{"name":"Абдихаев Замир"}}',
            299030 => '{"old":{"name":"Гульнар"},"new":{"name":"Кабиева Гульнар"}}',
            297554 => '{"old":{"name":"Толеухан"},"new":{"name":"Смаил Толеухан"}}',
            297311 => '{"old":{"name":"аскар"},"new":{"name":"дандыбаев аскар николаевич"}}',
            302039 => '{"old":{"name":"Балжан"},"new":{"name":"Таскаева Балжан"}}',
            300188 => '{"old":{"name":"данияр"},"new":{"name":"кумекбаев данияр куандыкович"}}',
            299460 => '{"old":{"name":"Марат"},"new":{"name":"Ахметов Марат Нургалиевич"}}',
            295378 => '{"old":{"name":"Н"},"new":{"name":"Саттыбаева Н"}}',
            301583 => '{"old":{"name":"Мадина"},"new":{"name":"батталова Мадина Ерлановна"}}',
            302052 => '{"old":{"name":"айнур"},"new":{"name":"алиева айнур"}}',
            302056 => '{"old":{"name":"Улан"},"new":{"name":"Рамазанов Улан"}}',
            302057 => '{"old":{"name":"еркебулан"},"new":{"name":"карабаев еркебулан алымович"}}',
            301687 => '{"old":{"name":"аяулым"},"new":{"name":"ибрагим аяулым аскаркызы"}}',
            300180 => '{"old":{"name":"Денис"},"new":{"name":"Кучерук Денис Викторович"}}',
            301722 => '{"old":{"name":"айгерим"},"new":{"name":"боханова айгерим кайратовна"}}',
            302129 => '{"old":{"name":"алибек"},"new":{"name":"ахметов алибек кенжебекулы"}}',
            302127 => '{"old":{"name":"Мансур"},"new":{"name":"дуйсенбек Мансур маратулы"}}',
            302142 => '{"old":{"name":"Диана"},"new":{"name":"Максуд Диана Шаховна"}}',
            279414 => '{"old":{"name":"молдир"},"new":{"name":"казбек молдир кайратовна"}}',
            302165 => '{"old":{"name":"асима"},"new":{"name":"кашигулина асима амангельдиевна"}}',
            301773 => '{"old":{"name":"ирина"},"new":{"name":"кравченко ирина алексеевна"}}',
            302180 => '{"old":{"name":"майра"},"new":{"name":"уткельбаева майра ашмухатовна"}}',
            292211 => '{"old":{"name":"данияр"},"new":{"name":"матенов данияр балтабаевич"}}',
            287001 => '{"old":{"name":"ирина"},"new":{"name":"зайцева ирина юрьевна"}}',
            302184 => '{"old":{"name":"Гульбарам"},"new":{"name":"Агибаева Гульбарам Бейсебаевна"}}',
            302192 => '{"old":{"name":"амир"},"new":{"name":"берикбол амир арманович"}}',
            263422 => '{"old":{"name":"Ляззат"},"new":{"name":"Жараскан Ляззат"}}',
            301099 => '{"old":{"name":"Виктор"},"new":{"name":"Сломинский Виктор иванович"}}',
            302203 => '{"old":{"name":"айла"},"new":{"name":"карибекова айла мирзатовна"}}',
            295855 => '{"old":{"name":"Татьяна"},"new":{"name":"Цой Татьяна Владиславовна"}}',
            302220 => '{"old":{"name":"Елена"},"new":{"name":"Розе Елена"}}',
            302222 => '{"old":{"name":"Шахида"},"new":{"name":"Едилова Шахида"}}',
            302225 => '{"old":{"name":"фарзана"},"new":{"name":"усенова фарзана достеновна"}}',
            302238 => '{"old":{"name":"Fgdfgd"},"new":{"name":"Sdfsdfs Fgdfgd Dfgdfgfd"}}',
            302240 => '{"old":{"name":"Бихава"},"new":{"name":"Мешебаева Бихава Нургазиевна"}}',
            302246 => '{"old":{"name":"олег"},"new":{"name":"Ионов олег"}}',
            302242 => '{"old":{"name":"инсар"},"new":{"name":"калтаев инсар тимурович"}}',
            302248 => '{"old":{"name":"акбота"},"new":{"name":"Батык акбота"}}',
            302258 => '{"old":{"name":"Vxcvxc"},"new":{"name":"Asdas Vxcvxc"}}',
            302257 => '{"old":{"name":"айсафи"},"new":{"name":"азербаева айсафи азербаевна"}}',
            302254 => '{"old":{"name":"И"},"new":{"name":"Динасылов И"}}',
            301723 => '{"old":{"name":"светлана"},"new":{"name":"кумсиева светлана яковлевна"}}',
            288060 => '{"old":{"name":"асель"},"new":{"name":"курмангазина асель кайрулиновна"}}',
            298693 => '{"old":{"name":"перизат"},"new":{"name":"алимбетова перизат сембековна"}}',
            296540 => '{"old":{"name":"лусине"},"new":{"name":"мусcаелян лусине"}}',
            302271 => '{"old":{"name":"карим"},"new":{"name":"рахманов карим"}}',
        ];
}
